app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "otro"], ["description", "otro articulo creado"], ["created_at", "2019-12-05 18:12:39.037912"], ["updated_at", "2019-12-05 18:12:39.037912"]]
---
 	def create
  		@article = Article.new(article_params)
  		@article.user = User.first
  		if @article.save

SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
 	def index
  		@articles = Article.paginate(page: params[:page], per_page: 5)