app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "1234"], ["updated_at", "2019-12-06 04:21:35.783809"], ["id", 2]]
---
 def update
  @user = User.find(params[:id])
  if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
---
def show
  @user = User.find(params[:id])
  @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT "users".* FROM "users"
---
 def index
  @users = User.paginate(page: params[:page], per_page: 5)